Autodesk.Revit.DB.Mechanical.WaterLoopData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.WaterLoopData.CondenserWaterLoopId
The water loop element id for the water cooled chiller.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Mechanical.WaterLoopData.ChillerType
The type of water chiller. Note this property change would reset the condenser water loop.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.WaterLoopData.WaterLoopType
The type of water loop. Note this property change would reset other properties.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.DB.Mechanical.WaterLoopData
Represents the data and parameters of analytical water loop.
Since:
2020.1